行政区划数据集

xzqh(code,name)

In [2]:
mysql://stu2101213030:stu2101213030@162.105.146.37:43306

In [3]:
show databases;

,Database
0,dataset
1,information_schema
2,stu2101213030

In [4]:
use dataset;

In [5]:
show tables;

,Tables_in_dataset
0,SurnameOrigin
1,TheWorldHappinessReport2015
2,TheWorldHappinessReport2016
3,TheWorldHappinessReport2017
4,TheWorldHappinessReport2018
5,TheWorldHappinessReport2019
6,itemscore
7,stock
8,supermarketTrans
9,titanic_gender_submission
10,titanic_test
11,titanic_train
12,xzqh

In [6]:
select * from xzqh limit 10;

,code,name
0,110000,北京市
1,110101,东城区
2,110102,西城区
3,110105,朝阳区
4,110106,丰台区
5,110107,石景山区
6,110108,海淀区
7,110109,门头沟区
8,110111,房山区
9,110112,通州区